src/Catalogs/ЦветоваяГаммаПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЦветоваяГаммаПланировщика</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаHex</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКрасный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаСиний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаЗеленый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаHex</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаКрасный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаСиний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаЗеленый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтображатьНаФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЦветоваяГаммаПланировщика/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область УправлениеФормой

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьОформлениеПредставленияЦвета(Форма)
	
	Элементы	= Форма.Элементы;
	Объект		= Форма.Объект;
	
	Элементы.ЦветПредставление.ЦветФона		= Новый Цвет(Объект.ЦветФонаКрасный, Объект.ЦветФонаЗеленый, Объект.ЦветФонаСиний);
	Элементы.ЦветПредставление.ЦветТекста	= Новый Цвет(Объект.ЦветТекстаКрасный, Объект.ЦветТекстаЗеленый, Объект.ЦветТекстаСиний);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЦветФонаHexНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЦветФонаВыборЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийЦвет", Новый Цвет(Объект.ЦветФонаКрасный, Объект.ЦветФонаЗеленый, Объект.ЦветФонаСиний));
	
	ОткрытьФорму("Обработка.ДиалогВыбораЦвета.Форма",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаHexПриИзменении(Элемент)
	Цвет = ПланировщикКлиентСервер.HexВЦвет(Объект.ЦветТекстаHex);
	Объект.ЦветТекстаКрасный	= Цвет.Красный;
	Объект.ЦветТекстаЗеленый	= Цвет.Зеленый;
	Объект.ЦветТекстаСиний		= Цвет.Синий;
	
	УстановитьОформлениеПредставленияЦвета(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмя
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОформлениеПредставленияЦвета(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ЦветФонаВыборЗавершение(Цвет, ДопПараметры) Экспорт
	Если НЕ ТипЗнч(Цвет) = Тип("Цвет") Тогда
		Возврат;
	КонецЕсли;
	
	ЦветHex = ПланировщикКлиентСервер.ЦветВHex(Цвет.Красный, Цвет.Зеленый, Цвет.Синий);
	
	Объект.ЦветФонаHex		= НРег(ЦветHex);
	Объект.ЦветФонаКрасный	= Цвет.Красный;
	Объект.ЦветФонаЗеленый	= Цвет.Зеленый;
	Объект.ЦветФонаСиний	= Цвет.Синий;
	
	УстановитьОформлениеПредставленияЦвета(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
